Repository: RooieDirk/openplotter
Catalog: locale/*/LC_MESSAGES/openplotter.po
Languages: fi

source: check
fi: tarkista

source: apply
fi: käytä

source: was not updated in the last (sec.)
fi: ei ollut päivitetty viimeisen (sek.)

source: was updated in the last (sec.)
fi: oli päivitetty viimeisen (sek.)

source: contains
fi: sisältää

source: Standalone tool
fi: Erillinen työkalu

source: settings
fi: asetukset

source: start
fi: käynnistä

source: stop
fi: pysäytä

source: cancel
fi: peruuta

source: no repeat
fi: ei toistoa

source: seconds
fi: sekunnit

source: minutes
fi: minuutit

source: hours
fi: tunnit

source: days
fi: päivät

source: wait
fi: odota

source: Enter seconds to wait in field "data".
fi: Kirjoita odotus sekunnit ”tiedot” kenttään.

source: command
fi: komento

source: Enter a Linux command and arguments in the field below.
fi: Anna Linux komento ja argumentit alla olevaan kenttään.

source: reset system
fi: resetoi järjestelmä

source: shutdown system
fi: sulje järjestelmä

source: stop NMEA multiplexer
fi: pysäytä NMEA multiplekseri

source: reset NMEA multiplexer
fi: palauta NMEA multiplekseri

source: stop WiFi access point
fi: pysäytä WiFi yhteys

source: Access point will be disabled. If you are on a headless system, you will not be able to reconnect again. Are you sure?
fi: Tukiaseman poistetaan käytöstä. Jos järjestelmäsi on päätteetön, et voi kytkeytyä uudelleen. Oletko varma?

source: start WiFi access point
fi: käynnistä WiFi yhteys

source: Be sure you have filled in all fields in "WiFi AP" tab.
fi: Varmista, että olet täyttänyt joka kentän ”WiFi AP”-välilehllä.

source: publish Twitter
fi: julkaise Twitterissä

source: Be sure you have filled in all fields in "Accounts" tab, and enabled Twitter checkbox. Enter text to publish in the field "data".
fi: Varmista, että olet täyttänyt kaikki kentät ”tilit”-välilehdellä, ja Twitter valittuna. Kirjoita Julkaistava teksti ”tiedot” lokeroon.

source: send e-mail
fi: lähetä sähköposti

source: Be sure you have filled in all fields in "Accounts" tab, and enabled Gmail checkbox. Enter the subject in the field "data".
fi: Varmista, että olet täyttänyt kaikki kentät ”tilit”-välilehdellä, ja Gmail valittuna. Kirjoita kohde ”tiedot” lokeroon.

source: send SMS
fi: lähetä tekstiviesti

source: Be sure you have enabled sending SMS in "SMS" tab. Enter the text in field "data".
fi: Varmista, että olet ottanut käyttöön lähetä SMS ”SMS”-välilehdellä. Kirjoita viesti ”tiedot” kenttään.

source: play sound
fi: toista ääni

source: stop all sounds
fi: lopeta kaikki äänet

source: show message
fi: näytä viesti

source: Enter the message in field "data".
fi: Kirjoita viesti kenttään ”tiedot”.

source: close all messages
fi: sulje kaikki viestit

source: start all actions
fi: aloita kaikki toimet

source: stop all actions
fi: pysäytä kaikki toimet

source: This action will stop all the triggers except the trigger which has an action "start all actions" defined.
fi: Tämä toiminto lopettaa kaikki käynnistimet paitsi ”käynnistä kaikki toimet” määrittelyn.

source: : High
fi: : Korkea

source: ATTENTION! if you set this GPIO output to "High" and there is not a resistor or a circuit connected to the selected GPIO pin, YOU CAN DAMAGE YOUR BOARD.
fi: HUOMIO! Jos asetat tämän GPIO asetuksen arvoksi ”High” eikä mitään vastusta tai piiriä ole liitetty valittuun GPIO pinniin, voi KONEESI VAURIOITUA.

source: : Low
fi: : Alhainen

source: Publish on topic:
fi: Julkaise aiheesta:

source: Set Signal K key value
fi: Aseta Signal K avaimen arvo

source: source:
fi: lähde:

source: timestamp:
fi: aikaleima:

source: Add 1W temperature sensor
fi: Lisää 1W lämpötila-anturi

source: Edit 1W temperature sensor
fi: Muokkaa 1W lämpötila-anturia

source: Signal K key
fi: Signal K näppäin

source: Edit
fi: Muokkaa

source: Name
fi: Nimi

source: allowed characters: 0-9, a-z, A-Z
fi: sallitut merkkit: 0-9, a-z, A-Z

source: Sensor ID
fi: Anturi tunnus

source: Offset
fi: Siirtymä

source: Failed. * must contain only allowed characters.
fi: Epäonnistui. * on oltava vain sallittuja merkkejä.

source: Failed. You have to provide a name for *.
fi: Epäonnistui. Sinun on annettava nimi *.

source: Failed. Select a Signal K key.
fi: Epäonnistui. Valitse Signal K-näppäin.

source: Failed. Provide a name.
fi: Epäonnistui. Anna nimi.

source: Failed. Name must contain only letters and numbers.
fi: Epäonnistui. Nimessä saa olla vain kirjaimia ja numeroita.

source: Failed. Select sensor ID.
fi: Epäonnistui. Valitse anturin tunnus.

source: Edit MCP analog input
fi: Muokkaa MCP analogista syötettä

source: aktiv
fi: aktivinen

source: convert
fi: muunna

source: clean
fi: puhdista

source: minimum raw value in setting table > 0
fi: minimi raw-arvo taulukkoon > 0

source: maximum raw value in setting table < 1023
fi: maksimi raw-arvo taulukkoon > 1023

source: no option value
fi: eI vaihtoehto arvoa

source: in openplotter.conf
fi: openplotter.confissa

source: Failed. Provide name and Signal K values.
fi: Epäonnistui. Anna nimi ja Signal K arvot.

source: Failed. The name must contain only letters and numbers.
fi: Epäonnistui. Nimessä saa olla vain kirjaimia ja numeroita.

source: add NMEA 0183 sentence
fi: lisää NMEA 0183 lause

source: Sentence
fi: Lause

source: Rate (sec)
fi: Luokitus (sec)

source: RMC examp
fi: RMC esim.

source: Field
fi: Kenttä

source: Value
fi: Arvo

source: --Select type
fi: --Valitse tyyppi

source: Expression
fi: Lauseke

source: Number
fi: Numero

source: String
fi: Merkkijono

source: --vessel
fi: --alus

source: --group
fi: --ryhmä

source: --key
fi: --avain

source: --operator
fi: --operaattori

source: Add value
fi: Lisää arvo

source: Delete value
fi: Poista arvo

source: Failed. String must contain only allowed characters.
fi: Epäonnistui. Merkkijonon pitää sisältää vain sallitut merkit.

source: FAILED. Fill in all the available fields.
fi: EPÄONNISTUI. Täytä kaikki kentät.

source: FAILED. This is not a valid expression.
fi: EPÄONNISTUI. Tämä ei ole kelvollinen lauseke.

source: FAILED. This field must be a number.
fi: EPÄONNISTUI. Tässä kentässä on oltava luku.

source: Generate N2K from Signal K
fi: Luo N2K signaali K:sta

source: description
fi: kuvaus

source: Signal K variable
fi: Signal K muuttuja

source: Apply changes
fi: Lisää muutokset

source: Add action
fi: Lisää toiminto

source: Edit action
fi: Muokkaa toimintoa

source: action
fi: toiminta

source: data
fi: tiedot

source: Add Signal K key
fi: Lisätä signaalin K-näppäin

source: repeat after
fi: toista jälkeen

source: Choose a file
fi: Valitse tiedosto

source: Audio files
fi: Audiotiedostot

source: All files
fi: Kaikki tiedostot

source: You can add the current value of any Signal K key typing its name between angle brackets, e.g: <navigation.position.latitude>
fi: Voit lisätä nykyisen arvon joka Signal K-näppäimeen, kirjoittamalla sen nimen kulma sulkuihin esim: <navigation.position.latitude>

source: Failed. Select an action.
fi: Epäonnistui. Valitse toimenpide.

source: Failed. "Repeat after" must be a number.
fi: Epäonnistui. ”Toistaa jälkeen” on oltava luku.

source: Deviation Table
fi: Poikkeama taulukko

source: deviation
fi: poikkeama

source: Magnetic Variation
fi: Magneettinen vaihtelu

source: Compass Heading
fi: Kompassi suunta

source: Magnetic Heading
fi: Mangneettinen suunta

source: True Heading
fi: Tosisuunta

source: change
fi: muuta

source: Reset
fi: Palauta

source: Close
fi: Sulje

source: graph
fi: kaavio

source: Set
fi: Määritä

source: This value is not a number.
fi: Tämä arvo ei ole numero.

source: Deviation table will be calculated with this variation. If you change this value you will have to define the complete table again.
fi: Poikkeama taulukko lasketaan tällä vaihtoehdolla. Jos muutat tätä arvoa täytyy koko taulukko määrittää uudelleen.

source: Add GPIO sensor
fi: Lisää GPIO anturi

source: input
fi: syöte

source: output
fi: lähtö

source: Pull
fi: Vedä

source: CAUTION. If you connect a closed switch or some inappropriate circuit, you could short out and damage your board when this output becomes "High". Are you sure to enable this output?
fi: VAROITUS. Jos liität suljettun kytkimen tai sopimattoman piirin, teet oikosulun ja vahingoitat korttikoneesi, kun tämä ulostulo on ”korkea”. Oletko varma jotta sallit tämän olostulon?

source: Question
fi: Kysymys

source: Failed. You must fill in all fields.
fi: Sinun tulee täyttää kaikki kentät.

source: Add I2C sensor without compass
fi: Lisää I2C anturi ilman kompassia

source: detected
fi: havaittu

source: Address
fi: Osoite

source: Addresses
fi: Osoitteet

source: add/update sensor
fi: lisää/Päivitä anturi

source: If your sensors are not detected right, try resetting system or forcing name and address. Do you want to try auto detection again?
fi: Jos antureita ei tunnistettu oikein, yritä palauttaa järjestelmä tai pakottaa nimi ja osoite. Haluatko kokeilla auto tunnistusta uudelleen?

source: Detected I2C addresses
fi: Havaitut I2C osoitteet

source: Add/Edit NMEA 0183 (KPLEX)
fi: Lisää/Muokkaa NMEA 0183 (KPLEX)

source: Type
fi: Tyyppi

source: settings
fi: asetukset

source: Port
fi: Portti

source: Bauds
fi: Baudit

source: in Filter
fi: sisään suodatin

source: none
fi: ei mitään

source: Accept only sentences:
fi: Hyväksy vain lauseet:

source: Ignore sentences:
fi: Ohita lauseet:

source: Add sentence
fi: Lisää lause

source: Delete
fi: Poista

source: out Filter
fi: ulos suodatin

source: nothing
fi: ei mitään

source: accept
fi: hyväksy

source: ignore
fi: ohita

source: Talker must have 2 uppercase characters. The symbol * matches any character.
fi: Talkerissa on oltava 2 isoa kirjainta. Merkki * vastaa mitä tahansa merkkiä.

source: Sentence must have 3 uppercase characters. The symbol * matches any character.
fi: Lauseessa on oltava 3 isoa kirjainta. Merkki * vastaa mitä tahansa merkkiä.

source: You must enter 2 uppercase characters for talker or 3 uppercase characters for sentence. The symbol * matches any character.
fi: Talkkerille kirjoitetaan 2 isoa kirjainta ja lauseeseen 3 isoa kirjainta, *merkki vastaa mitätahansa merkkiä.

source: This sentence already exists.
fi: Tämä lause on jo olemassa.

source: "Name" must be a string between 1 and 13 lowercase letters and/or numbers which is not used as name for another input/output.
fi: ”Nimi” on oltava merkkijono 1 - 13 pientä kirjainta ja/tai numeroa, jota ei käytetä toisessa input/output kohdassa.

source: This name is already in use.
fi: Nimi on jo käytössä.

source: This name is reserved by the system.
fi: Tämä on järjestelmän varaama nimi.

source: You must select a Port.
fi: Määritä portti.

source: This output is already in use.
fi: Tämä ulostulo on jo käytössä.

source: You must enter an Address.
fi: Kirjoita osoite.

source: You must enter a Port.
fi: Määritä portti.

source: Cancelled. Port 10111-10113 are reserved.
fi: Peruttu. Portit 10111 - 10113 on varattu.

source: This input is already in use.
fi: Tämä tulo on jo käytössä.

source: You must select a Filter type.
fi: Valitse suodatintyyppi.

source: Tool
fi: Työkalu

source: Add MQTT topic
fi: Lisää MQTT aihe

source: Edit MQTT topic
fi: Muokkaa MQTT aihetta

source: Topic
fi: Aihe

source: General
fi: Yleistä

source: Signal K key input
fi: Signal K avain tulo

source: Signal K delta input
fi: Signal K delta tulo

source: Add trigger
fi: Lisää käynnistin

source: Edit trigger
fi: Muokkaa käynnistintä

source: Date
fi: Päivä

source: Operator
fi: Operaattori

source: format:
fi: muoto:

source: Failed. Enter a value.
fi: Epäonnistui. Kirjoita arvo.

source: Failed. Select value, timestamp or source.
fi: Epäonnistui. Valitse arvo, aikaleima tai lähde.

source: convert analog value to expected value of input
fi: muunna analogiarvo odotusarvosyötteeksi

source: adc value
fi: adc arvo

source: value in unit
fi: arvo yksikössä

source: raw adc value
fi: raaka adc arvo

source: value in required unit
fi: arvo oikeassa yksikössä

source: add
fi: lisää

source: delete
fi: poista

source: nothing selected
fi: mitään ei ole valittu

source: adc value must be a number without dec point
fi: adc-arvon on oltava luku ilman desimaaleja

source: value isn't a number
fi: arvo ei ole numero

source: Clean
fi: Puhdista

source: Rate (seconds)
fi: Luokitus (sekuntia)

source: File not found:
fi: Tiedostoa ei löydy:

source: ungrouped
fi: ryhmätön

source: Select Signal K key
fi: Valitse Signal K nappi

source: Groups
fi: Ryhmät

source: Keys
fi: Avaimet

source: Ungrouped Signal K keys.
fi: Ryhmittelemättömät Signal K avaimet.

source: Show Signal K keys
fi: Näytä Signaal K näppäimet

source: All actions have been stopped.
fi: Kaikki toiminnot on lopetettu.

source: All actions have been started.
fi: Kaikki toimet on aloitettu.

source: Interval
fi: Aikaväli

source: Sort SRC
fi: Lajittele SRC

source: Sort PGN
fi: Lajittele PGN

source: Device
fi: Laite

source: Pause
fi: Tauko

source: Sort
fi: Järjestä

source: connected to:
fi: yhdistetty:

source: Failed to connect with localhost:10113. Error:
fi: Yhteys localhost:10113 epäonnistui. Virhe:

source: , trying to reconnect...
fi: , yrittää uudelleen...

source: Resume
fi: Jatka

source: Unit
fi: Yksikkö

source: Status
fi: Tila

source: Description
fi: Kuvaus

source: Sort SK
fi: Lajittele SK

source: Show All SK keys
fi: Näytä kaikki SK näppäimet

source: private Unit
fi: oma yksikkö

source: Unit Setting
fi: Yksikkö asetus

source: Message
fi: Viesti

source: Show deviation table as curve
fi: Näytä poikkeamataulu käyränä

source: Deviation
fi: Poikkeama

source: settings to convert raw adc values (unlinear and/or no factor and/or no offset) to useable values for input
fi: asetukset, kun muutetaan raa'at adc-arvot (eilinearinen ja/tai ei mikään osatekijä ja/tai siirros) käyttökelpoisiksi syöttöarvoiksi

source: row adc value
fi: adc riviarvo

source: Test SMS
fi: Testi SMS

source: Error
fi: Virhe

source: Start
fi: Aloita

source: Press start to check the settings and connect to the GSM device
fi: Paina start yhteysasetusten tarkistamiseksi GSM-laitteeseen

source: Press start to send the text "
fi: Paina start tekstin lähettämiseksi”

source: " to the number "
fi: " numeroon "

source: Connecting...
fi: Yhdistetään...

source: Error opening device. Check settings.
fi: Virhe laiteen avauksessa. Tarkista asetukset.

source: Sending...
fi: Lähettää...

source: " sent succesfully to
fi: ”lähettäminen onnistui ja

source: Finished
fi: Valmis

source: NMEA 0183 generator
fi: NMEA 0183 generaattori

source: Rate
fi: Taso

source: Fields
fi: Kentät

source: opencpn default
fi: opencpn oletus

source: NMEA Diagnostic
fi: NMEA-diagnostiikka

source: SK Diagnostic
fi: SK diagnostiikka

source: This function is only allowed when the list is empty.
fi: Tämä toiminto on sallittu vain, kun luettelo on tyhjä.

source: SDR receiver
fi: SDR vastaanotin

source: Enable AIS reception
fi: Salli AIS vastaanotto

source: Gain
fi: Vahvistus

source: Correction (ppm)
fi: Korjaus (ppm)

source: Channel A 161.975Mhz
fi: Kanava A 161.975Mhz

source: Channel B 162.025Mhz
fi: Kanava B 162.025Mhz

source: Take a look
fi: Tutustu

source: Calibration
fi: Kalibrointi

source: Fine calibration using GSM
fi: Hieno kalibrointi GSM avulla

source: Band
fi: Taajuus

source: Check band
fi: Tarkista taajuus

source: Channel
fi: Kanava

source: Fine calibration
fi: Hieno kalibrointi

source: SDR-AIS reception enabled
fi: SDR-AIS vastaanotto käytössä

source: SDR-AIS reception disabled
fi: SDR-AIS vastaanotto estetty

source: AIS reception disabled. After closing the new window enable AIS reception again.
fi: AIS vastaanotto estetty. Sulkemisen jälkeen uusi ikkuna sallii AIS vastaanoton uudelleen.

source: SDR-AIS reception disabled. Check the new window. Copy the maximum supported gain value. Wait for ppm value to stabilize and copy it too.
fi: SDR-AIS vastaanotto estetty. Tarkista uudessa ikkunassa. Kopioi maksimi tuettu vahvistusarvo. Odota ppm arvoa vakauttamiseksi ja kopioi se.

source: gain:
fi: vahvistus:

source: Calculate
fi: Laske

source: Press Calculate and wait for the system to calculate the ppm value with the selected channel. Put the obtained value in "Correction (ppm)" field and enable SDR-AISreception. Estimated time: 1 min.
fi: Paina Laske ja odota kun järjestelmä laskee ppm arvon valittuun kanavaan. Pane saatu arvo ”korjaus (ppm)”-kenttään se mahdollistaa SDR-AISvastaanoton. Arvioitu aika: 1 min.

source: channel:
fi: kanava:

source: Press Calculate and wait for the system to check the band. Write down the strongest channel (power). If you do not find any channel try another band. Estimated time: 5 min.
fi: Paina Laske ja odota kun järjestelmä tarkistaa aaltoalueen. Kirjoita muistiin vahvin kanava (teho). Jos et löydä kanava yrittää toiselta aaltoalueelta. Arvioitu aika: 5 min.

source: Working...
fi: Työstetään...

source: error
fi: virhe

source: Magnetic variation
fi: Magneettinen vaihtelu

source: Enable
fi: Ota käyttöön

source: Requires: position, date.
fi: Vaatii: sijainti, päivämäärä.

source: Accuracy (sec)
fi: Tarkkuus (sec)

source: Rate of turn
fi: Kääntymisnopeus

source: Requires: magnetic heading.
fi: Vaatii: magneettisen suunnan.

source: True heading
fi: Tosisuunta

source: Deviation is included
fi: Poikkeama sisältyy

source: Requires: magnetic heading, variation.
fi: Vaatii: magneettisen suunnan, vaihtelun.

source: Add deviation table
fi: Lisää poikkeama taulukko

source: Requires: magnetic heading, variation, deviation.
fi: Vaatii: magneettisen suunnan, vaihtelun, poikkeaman.

source: True wind speed and direction
fi: Tuulen tosi nopeus ja suunta

source: Use Speed Through Water
fi: Käytä nopeutta veden suhteen

source: Requires: SignalK STW, AWS, AWA.
fi: Vaatii: SignalK STW, AWS AWA.

source: Use Speed Over Ground
fi: Käytä nopeus pohjan suhteen

source: Requires: SignalK SOG, COG, HDT, AWS, AWA.
fi: Vaatii: SignalK SOG, COG, HDT, AWS, AWA.

source: Cancel
fi: Peru

source: You have to provide rate and accuracy values for magnetic variation
fi: Sinun on annettava erannon määrä ja tarkkuus arvot

source: You have to provide rate and accuracy values for true heading
fi: Sinun on annettava tosisuunnan määrä ja tarkkuus arvot

source: You have to provide rate and accuracy values for rate of turn
fi: Sinun on annettava kääntymisnopeuden määrä ja tarkkuus arvot

source: You have to provide rate and accuracy values for true wind speed and direction
fi: Sinun on annettava tosituulen suunnan ja nopeuden tarkkuus ja määrä arvot

source: Demo tool
fi: Demo-työkalu

source: To create tools see ~/.openplotter/tools/README.md.
fi: Jos luot työkaluja katso ~ /.openplotter/tools/README.md.

source: OpenPlotter config data
fi: OpenPlotter configurointi tiedot

source: OpenPlotter version:
fi: OpenPlotterin versio:

source: Working with Signal K
fi: Toimitaan Signal K kanssa

source: Select a Signal K key
fi: Valitse Signal K nappi

source: Write some text to publish
fi: Kirjoita tekstiä julkaistavaksi

source: Publish
fi: Julkaise

source: Moitessier HAT Settings
fi: Moitessier HAT asetukset

source: Info
fi: Tiedot

source: Settings
fi: Asetukset

source: Install
fi: Asenna

source: HAT info
fi: HAT tiedot

source: Statistics
fi: Tilastot

source: Reset statistics
fi: Nollaa tilastot

source: Sensors
fi: Anturit

source: Disable
fi: Poista käytöstä

source: General
fi: Yleistä

source: Reset HAT
fi: Nollaa HAT

source: Load defaults
fi: Lataa oletukset

source: enable simulator
fi: salli simulaattori

source: interval (ms)
fi: väli (ms)

source: MMSI boat 1
fi: MMSI vene 1

source: MMSI boat 2
fi: MMSI vene 2

source: frequency 1
fi: taajuus 1

source: frequency 2
fi: taajuus 2

source: Current Kernel version
fi: Nykyinen ytimen versio

source: Available packages
fi: Saatavilla olevat paketit

source: Moitessier HAT is not attached!
fi: Moitessier HAT ei ole liitetty!

source: Moitessier HAT is attached.
fi: Moitessier HAT on liitetty.

source: Moitessier HAT package is not installed!
fi: Moitessier HAT paketti ei ole asennettu!

source: Moitessier HAT package is installed.
fi: Moitessier HAT paketti on asennettu.

source: All changes will be temporal. Default settings will be loaded after rebooting.
fi: Kaikki muutokset ovat tilapäisiä. Oletusasetukset ladataan uudelleenkäynnistyksen jälkeen.

source: Select the package that matches the current Kernel version. Before installing, be sure the HAT is not being used by any service (kplex, GPSD, OpenCPN ...). If installation fails, you may have to try to install the package several times.
fi: Valitse paketti, joka on yhteensopiva nykyisen ytimen kanssa. Ennen asennusta, varmista, että HAT ei ole minkään palvelun käytössä (kplex, GPSD, OpenCPN...). Jos asennus epäonnistuu, sinun täytyy yrittää asentaa paketti useita kertoja.

source: Failure reading config.xml file!
fi: Virhe luettaessa config.xml tiedostoa!

source: Select a package to install.
fi: Valitse asennettava paketti.

source: Updating Moitessier Hat modules and firmware...
fi: Päivitetään Moitessier Hat moduulit ja firmware...

source: Defaults loaded.
fi: Oletukset ladattu.

source: Changes applied.
fi: Muutokset lisätty.

source: Apply changes failed!
fi: Muutokset epäonnistui!

source: SK Unit
fi: SK yksikkö

source: Sort SK Unit
fi: Lajittele SK yksikkö

source: Sort Unit
fi: Lajittele yksikkö

source: change selected
fi: muutta valittu

source: Serial ports
fi: Sarjaportit

source: Actions
fi: Toiminnot

source: Accounts
fi: Tilit

source: Startup
fi: Käynnistys

source: Set an SDR receiver in the new window
fi: Aseta SDR-vastaanotin uudessa ikkunassa

source: Create a deviation table for your boat
fi: Luo poikkeama taulukko veneeseesi

source: Calculate new data from current values
fi: Laske uudet tiedot nykyarvoista

source: Generate NMEA 0183 from current values
fi: Luo NMEA 0183 nykyarvoista

source: Tools
fi: Työkalut

source: Set Basque language
fi: Aseta Baskin kieli

source: Catalan
fi: Katalaani

source: Set Catalan language
fi: Aseta Catalan kieli

source: Dutch
fi: Hollanti

source: Set Dutch language
fi: Aseta Hollannin kieli

source: English
fi: Englanti

source: Set English language
fi: Aseta Englannin kieli

source: French
fi: Ranska

source: Set French language
fi: Aseta Ranskan kieli

source: Set Galician language
fi: Aseta Calician kieli

source: German
fi: Saksa

source: Set German language
fi: Aseta Saksan kieli

source: Set Italian language
fi: Aseta Italian kieli

source: Spanish
fi: Espanja

source: Set Spanish language
fi: Aseta Espanjan kieli

source: Language
fi: Kieli

source: Update OpenCPN
fi: Päivitä OpenCPN

source: Update OpenCPN to latest stable release
fi: Päivitä OpenCPN Viimeiseen vakaaseen versioon

source: Update OpenCPN plugins
fi: Päivittä OpenCPN pluginit

source: Update OpenCPN plugins to latest stable releases
fi: Päivitä OpenCPN pluginit viimeiseen vakaaseen versioon

source: Set default OpenPlotter desktop
fi: Aseta oletus OpenPlotter desktop

source: Run this after a major update
fi: Suorita tämä pääpäivityksen jälkeen

source: Update OpenPlotter
fi: Päivitä OpenPlotter

source: Apply latest changes on OpenPlotter and update the system if necessary
fi: Lisää viimeisimmät muutokset OpenPlotteriin ja päivitä järjestelmä tarvittaessa

source: Updates
fi: Päivitykset

source: &About
fi: Tietoja

source: About OpenPlotter
fi: Tietoja OpenPlotterista

source: Online documentation
fi: Online-dokumentaatio

source: OpenPlotter online documentation
fi: OpenPlotter online-dokumentaatio

source: &Help
fi: &Apua

source: The selected language will be enabled when you restart
fi: Valittu kieli tulee käyttöön, kun käynnistät

source: Follow the instructions of the new window
fi: Noudata uuden ikkunan ohjeita

source: It was not possible to connect to Github.
fi: Ei voitu yhdistää githubiin.

source: Error reading versions.
fi: Virhe versioiden käsittelyssä.
