Repository: RooieDirk/openplotter
Catalog: locale/*/LC_MESSAGES/openplotter.po
Languages: fi

source: You are running a stable version. If you update to a non stable version you will have to keep updating until a stable stage is reached again.
fi: Käytössäsi on vakaa versio. Jos vaihdat kehitysversioon, sitä täytyy päivittää kunnes on tultu vakaaseen versioon jälleen.

source: There is a major Raspbian upgrade, you have to download the new OpenPlotter image: v
fi: On Raspbianin versio päivitys, on suositeltavaa ladata uusi OpenPlotter rpi kuva: v

source: There is a major OpenPlotter update.
fi: On OpenPlotterin versiopäivitys.

source: Please make a backup image of your system before updating.
fi: Teethän täyden backupin systeemistäsi ennen päivitystä.

source: There is a minor OpenPlotter update.
fi: On pieni OpenPlotter-päivitys.

source: is up to date.
fi: on ajan tasalla.

source: Are you sure you want to update:
fi: Oletko varma, että haluat päivittää:

source: OpenPlotter is a DIY, open-source, low-cost, low-consumption, modular and scalable sailing platform to run on ARM boards.
fi: OpenPlotter on DIY, avoimen lähdekoodin, edullinen, vähään tyytyvä, modulaarinen ja skaalautuva purjehdus alusta ajettavaksi ARM-laudoilla.

source: Delay (seconds)
fi: Viive (sekuntia)

source: no OpenGL
fi: ei OpenGLää

source: fullscreen
fi: koko näyttö

source: Play sound
fi: Toista ääni

source: File
fi: Tiedosto

source: Maximize OpenPlotter
fi: Maksimoi OpenPlotter

source: You can enter only numbers.
fi: Voi syöttää ainoastaan numeroita.

source: Startup delay set to
fi: Käynnistys viive asetettu

source: seconds
fi: sekuntia

source: Enable access point
fi: Salli tukiasema

source: Enable bridge to eth0
fi: Salli yhteys eth0aan

source: Access point device
fi: Yhteys toimilaite

source: Sharing Internet device
fi: Internetin jakolaite

source: Access point settings
fi: Yhteysosoitteen asetuksia

source: SSID maximum 32 characters
fi: SSID enintään 32 merkkiä

source: Password minimum 8 characters required
fi: Salasan pituus vähintäin 8 merkkiä

source: Mode
fi: Tila

source: Both
fi: Molemmat

source: Defaults
fi: Oletus

source: Apply
fi: Käytä

source: Addresses
fi: Osoitteet

source: Refresh
fi: Päivitä

source: "Access point device" and "Sharing Internet device" must be different
fi: "Yhteyspite laite" ja "Netin jakolaite" pitää olla erillisiä

source: Your SSID must have a maximum of 32 characters and your password a minimum of 8.
fi: Sinun SSIDsi täytyy olla enintään 32 merkkiä salasanassasi vähintään 8 merkkiä.

source: Changes will be applied. If something goes wrong and you are on a headless system, you may not be able to reconnect again. Are you sure?
fi: Muutokset lisätään. Jos jotakin menee metsään ja olet päätteettömässä systeemissä, et voi enää kytkeytyä uudelleen?

source: Configuring WiFi AP, please wait max 3 min...
fi: Määritetään WiFi AP, odota max 3 min...

source: Shutdown WiFi AP, please wait max 3 min...
fi: Sammutetaan WiFi AP odota max 3 min...

source: WiFi access point failed.
fi: WiFi-tukiasema tökkäsi.

source: WiFi access point started.
fi: WiFi-tukiaseman käynnistyi.

source: WiFi access point stopped.
fi: WiFi-tukiaseman pysähtyi.

source: Multiplexed NMEA 0183:
fi: Multipleksattu NMEA 0183:

source: VNC remote desktop:
fi: VNC Etätyöpöytä:

source: MQTT local broker:
fi: MQTT paikallinen välittäjä:

source: pypilot Mode:
fi: pypilot tila:

source: disabled
fi: pois käytöstä

source: IMU only
fi: Vain IMU

source: basic autopilot
fi: perus autopilotti

source: Detected IMU:
fi: Havaittu IMU:

source: None
fi: Ei mitään

source: Autopilot
fi: Autopilotti

source: Serial ports (Controller/Wind/GPS)
fi: Sarjaportit (Controller/tuuli/GPS)

source: Enable webapp
fi: Salli webapp

source: port:
fi: portti:

source: Scope
fi: Laajuus

source: Client
fi: Asiakas

source: Autopilot Control
fi: Autopilotti hallinta

source: Restart
fi: Aloita alusta

source: Cancel changes
fi: Peru muutokset

source: Translation Rate (seconds)
fi: Käännös aika (sekuntia)

source: Compass settings will be deleted. You will have to calibrate again. Are you sure?
fi: Kompassi asetukset poistetaan. Täytyy kalibroida uudelleen. Oletko varma?

source: Port/Address
fi: Portti/osoite

source: Bauds/Port
fi: Baudia/portti

source: inFilter
fi: suodatin sisään

source: Filtering
fi: Suodatus

source: outFilter
fi: suodatin ulos

source: Diagnostic
fi: Diagnostiikka

source: add network
fi: lisää verkko

source: Advanced
fi: Kehittynyt

source: OpenPlotter will close. Add manual settings at the end of the configuration file. Open OpenPlotter again and restart multiplexer to apply changes.
fi: OpenPlotter sulkeutuu. Lisää manuaaliset asetukset määritykset-tiedoston loppuun. Avaa OpenPlotter uudelleen ja käynnistä multiplekseri tekemään muutokset.

source: Closing Kplex
fi: Kplex suljetaan

source: Kplex restarted
fi: Kplex käynnistetään uudelleen

source: You can not edit this.
fi: Tätä ei voi muokata.

source: Multiplexer configuration file does not exist. Add inputs and apply changes.
fi: Multiplekseri kokoonpanotiedostoa ei ole olemassa. Lisää syötteet ja muutokset.

source: Select an item.
fi: Valitse kohde.

source: You can not delete this
fi: Et voi poistaa tätä

source: Unassign this device on "Serial ports" tab
fi: Tämän laitteen poistaminen ”sarjaporttit”-välilehdessä

source: Magnitude
fi: Laajuus

source: Failed. You must select a sensor.
fi: Epäonnistui. Valitse tunnistin.

source: Failed. You must provide an address.
fi: Epäonnistui. Anna osoite.

source: Select an item to delete.
fi: Valitse poistettava kohde.

source: Sensors restarted
fi: Anturit käynnistetty

source: Sensors stopped
fi: Anturit pysäytetty

source: channel
fi: kanava

source: value setting
fi: arvon asetus

source: convert disabled
fi: muutos estetty

source: Source
fi: Lähde

source: Gmail account
fi: Gmail-tili

source: Gmail password
fi: Gmail-salasana

source: Recipient
fi: Vastaanottaja

source: Enter valid Twitter apiKey, apiSecret, accessToken and accessTokenSecret.
fi: Kirjoita kelvollinen Twitter-apiKey, apiSecret, accessToken ja accessTokenSecret.

source: Enter valid Gmail account, Gmail password and Recipient.
fi: Anna kelvollinen Gmail-tili, Gmail salasana ja vastaanottaja.

source: Triggers
fi: Käynnistimet

source: trigger
fi: liipaisin

source: operator
fi: operaattori

source: value
fi: arvo

source: repeat
fi: toista

source: Stop all
fi: Pysäytä kaikki

source: Start all
fi: Käynnistä kaikki

source: Select a trigger to add actions.
fi: Valitse liipasin lisätäksesi toimintoja.

source: Actions changes cancelled
fi: Toimintojen muutokset peruutettu

source: Actions stopped
fi: Toimet pysäytetty

source: Actions started
fi: Toimet käynnistetty

source: Temperature sensors
fi: Lämpötila-anturit

source: 1W sensors restarted
fi: 1W anturit käynnistetty

source: 1W sensors stopped
fi: 1W anturit pysäytetty

source: name
fi: nimi

source: device
fi: laite

source: vendor
fi: toimittaja

source: product
fi: tuote

source: port
fi: portti

source: serial
fi: sarja

source: assignment
fi: tehtävä

source: remember
fi: muista

source: bauds
fi: baudit

source: name /dev/ttyOP_
fi: nimi/dev/ttyOP_

source: Remember device (by vendor, product, serial)
fi: Muista laitteen (myyjä, tuote-, sarja-numero)

source: Remember port (positon on the USB-hub)
fi: Muista porti (paikka USB-hubissa)

source: refresh
fi: päivitä

source: enable UART
fi: salli UART

source: disable UART
fi: poista UART

source: Warning: You have connected the "
fi: Varoitus: olet liittänyt ”

source: " to the usb port which is reserved for another device
fi: ”usb porttiin, joka on varattu toiselle laitteelle

source: Failed. No port selected
fi: Epäonnistui. Porttia ei ollut valittu

source: Checking selected device ...
fi: Tarkistaa valitun laitteen...

source: Suitable parameters according to your system settings. Press apply to save.
fi: Sopivat parametrien Järjestelmäasetukset. Paina käytä Tallenna.

source: We have not found any recognizable data on your device.
fi: Emme ole löytäneet mitään tunnistettavia tietoja laitteessa.

source: Failed. You have to provide a name (between 1 and 8 letters and/or numbers).
fi: Epäonnistui. Sinun on annettava nimi (1 - 8 kirjainta ja/tai numeroa).

source: Failed. Same name used for multiple devices
fi: Epäonnistui. Samaa nimeä käytetään useilla laitteilla

source: Failed. The new name must be a string between 1 and 8 letters and/or numbers.
fi: Epäonnistui. Uuden nimen täytyy olla merkkijono 1 - 8 kirjainta ja/tai numeroa.

source: Failed. Select bauds.
fi: Epäonnistui. Valitse baudit.

source: Warning: USB-Port with duplicate vendor product must be set to "Remember port".
fi: Varoitus: USB-portin saman toimittajan tuotteet on määritettävä ”muista portit” kohdassa.

source: Warning: This port is already reserved and must be set to "Remember device".
fi: Varoitus: Tämä portti on jo varattu ja määritettävä ”muista laite” kohdassa.

source: Restarting ...
fi: Käynnistetään uudelleen...

source: Failed. Same name used for multiple devices:
fi: Epäonnistui. Samaa nimeä käytetään useita laitteita:

source: Serial port modified and restarted
fi: Sarjaporttia muutettu ja käynnistetty

source: Failed. You can assign only one
fi: Epäonnistui. Voit määrittää vain yhden

source: device
fi: laite

source: This action disables Bluetooth and enables UART. OpenPlotter will reboot.
fi: Tämä toiminto estää Bluetoothin ja mahdollistaa UARTin. OpenPlotter käynnistyy uudelleen.

source: Are you sure?
fi: Oletko varma?

source: This action disables UART and enables Bluetooth. OpenPlotter will reboot.
fi: Tämä toiminto poistaa käytöstä UARTin ja mahdollistaa Bluetoothin. OpenPlotter käynnistyy uudelleen.

source: CAN-USB port:
fi: CAN-USB-portti:

source: Input
fi: Syöte

source: Enable N2K input
fi: Ota käyttöön N2K syöttö

source: Output
fi: Lähtö

source: Enable N2K output
fi: Ota käyttöön N2K tulo

source: Input can0
fi: Syöttö can0

source: Enable can0 N2K input
fi: Ota käyttöön can0 N2K syöttö

source: Device settings
fi: Laiteasetukset

source: Signal K to N2K converter
fi: Signal Ksta N2Kksi muunnin

source: Select PGNs to transmit and enable N2K input/output again.
fi: Valitse PGNt välittämään ja sallimaan N2K syöttö/lähtö uudelleen.

source: Show received PGNs.
fi: Näytä vastaanotetut PGNt.

source: Show sent PGNs.
fi: Näytä lähetetyt PGNt.

source: You have to add a CAN-USB device on Serial ports tab
fi: Sinun täytyy lisätä CAN-USB-laite Sarjaportit-välilehdessä

source: Closing Signal K server ...
fi: Suljetaan Signal K palvelin...

source: Signal K server restarted
fi: Signal K palvelin käynnistetään uudelleen

source: Settings
fi: Asetukset

source: Enable settings
fi: Aktivoi asetukset

source: Serial port
fi: Sarjaportti

source: Bluetooth address
fi: Bluetooth-osoite

source: Connection
fi: Yhteys

source: Identify
fi: Tunnista

source: Sending
fi: Lähettää

source: Enable sending SMS
fi: Salli SMS lähettäminen

source: Send to phone
fi: Lähetä puhelimeen

source: Text
fi: Teksti

source: Test
fi: Testi

source: You have to provide a serial port or a bluetooth address.
fi: Sinun on annettava sarjaporti- tai bluetooth-osoite.

source: You have to provide a connection type.
fi: Sinun on annettava yhteystyyppi.

source: You have to enable settings.
fi: Sinun täytyy sallia asetukset.

source: You have to provide a phone number.
fi: Sinun täytyy antaa puhelinnumero.

source: You have to provide some text to send.
fi: Sinun täytyy tehdä tekstiä lähetettäväksi.

source: Remote broker
fi: Etävälittäjä

source: Username
fi: Käyttäjänimi

source: Password
fi: Salasana

source: Clear
fi: Tyhjennä

source: MQTT restarted
fi: MQTT käynnistetty uudelleen

source: MQTT stopped
fi: MQTT pysäytetty

source: multiple keys
fi: useita avaimia

source: multiple sources
fi: useita lähteitä

source: Failed. Apply settings change.
fi: Epäonnistui. Lisää asetusmuutos.

source: Failed. You have to provide a name for the topic.
fi: Epäonnistui. Sinun on annettava aiheelle nimi.

source: Failed. Topics must contain only allowed characters.
fi: Epäonnistui. Aiheen pitää sisältää vain sallitut merkit.

source: Failed. Topic name must be unique.
fi: Epäonnistui. Aiheen nimen on oltava yksilöllinen.

source: Failed. You have to provide a Signal K key.
fi: Epäonnistui. Sinun on annettava Signal K-avain.

source: Failed. You have to select a type for the topic.
fi: Epäonnistui. Sinun täytyy valita aiheen tyyppi.

source: Enter at least username and password.
fi: Anna ainakin käyttäjätunnus ja salasana.

source: Settings and topics will be deleted. Are you sure?
fi: Asetukset ja aiheet poistetaan. Oletko varma?

source: Starting OpenPlotter
fi: Avaa OpenPlotter

source: Starting OpenPlotter. Please wait for all services to start.
fi: Avaa OpenPlotter. Odota, kunnes kaikki palvelut käynnistyneet.

source: There are some warnings. Please close this window and check your system.
fi: On joitakin varoituksia. Sulje tämä ikkuna ja tarkista järjestelmä.

source: Checking Signal K password...
fi: Tarkistetaan Signal K salasana...

source: Security warning: You are using the default password for Signal K server (openplotter). Please change password in Signal K > Security > Users > openplotter.
fi: Suojausvaroitus: oletussalasanaa käytetään Signal K serveriin (openplotter). Vaihda salasana kohdassa Signal K > turvallisuus > käyttäjät > openplotter.

source: See warning.
fi: Lue varoitus.

source: Done.
fi: Tehty.

source: Checking Signal K defaults...
fi: Tarkistetaan Signal K oletusasetukset...

source: Checking pi password...
fi: Tarkistaa pi salasanaa...

source: Security warning: You are using the default password for "pi" user (raspberry). Please change password in Menu > Preferences > Raspberry Pi Configuration.
fi: Suojausvaroitus: käytät oletussalasana ”pi” käyttäjälle (raspberry). Vaihda salasana valikosta > Asetukset > Vadelma Pi kokoonpano.

source: Applying
fi: Otetaan käyttöön

source: seconds of delay...
fi: sekunttien viive...

source: Starting WIFI Access Point...
fi: Käynnistetään WIFI yhteys...

source: Starting WIFI Client...
fi: WIFI-asiakkaan käynnistäminen...

source: Checking WIFI Access Point password...
fi: Tarkistetaan WIFI-tukiaseman salasana...

source: Security warning: You are using the default WIFI Access Point password (12345678). Please change password in OpenPlotter > WiFi AP.
fi: Suojausvaroitus: käytät WIFI-tukiaseman oletussalasanaa (12345678). Vaihda salasana OpenPlotter > WiFi AP kohdassa.

source: Starting MQTT server...
fi: Käynnistetään MQTT palvelinta...

source: Starting 1W sensors...
fi: Käynnistetään 1W anturit...

source: Starting N2K server...
fi: Käynnistetään N2K palvelinta...

source: Starting actions and NMEA 0183/N2K generators...
fi: Käynnistetään toimet ja NMEA 0183/N2K generaattorit...

source: Starting Node-RED...
fi: Käynnistetään Node-RED...

source: Starting I2C, SPI, GPIO and Pypilot...
fi: Käynnistetään I2C-, SPI-, GPIO- ja Pypilot...

source: Starting Pypilot Web App...
fi: Käynnistetään Pypilot Web App...

source: Starting SDR AIS reception...
fi: Käynnistetään SDR AIS vastaanotto...

source: Checking 800x480 display...
fi: Tarkistetaan 800 x 480 näytön...

source: Starting NMEA 0183 Multiplexer...
fi: Käynnistä NMEA 0183 multiplekseri...

source: Starting OpenCPN...
fi: Käynnistetään OpenCPN...

source: Starting Tools...
fi: Käynnistetään työkalut...

source: Checking OpenPlotter updates...
fi: Tarkistetaan OpenPlotter päivitykset...

source: It was not possible to connect to Github.
fi: Ei voitu yhdistää githubiin.

source: Error reading versions.
fi: Virhe versioiden käsittelyssä.

source: There is a major Raspbian upgrade, you have to download the new OpenPlotter image: v
fi: On suuri Raspbian päivitys, sinun on ladattava uusi OpenPlotter kuva: v

source: See CHANGELOG:
fi: Katso MUUTOSLOKI:

source: There is a major OpenPlotter update:
fi: On OpenPlotterin versiopäivitys:

source: There is a minor OpenPlotter update:
fi: On pieni OpenPlotter-päivitys:

source: is up to date.
fi: on ajan tasalla.

source: Not Started.
fi: Ei käynnistetty.
